In [1]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
     ---------------------------------------- 11.9/11.9 MB 2.9 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp310-cp310-win_amd64.whl size=247958 sha256=f47143e56120852f0b520f3d39bfbf518dfd97cfec8c1e7aa12321ca78f57ae9
  Stored in directory: c:\users\prajw\appdata\local\pip\cache\wheels\3e\7f\a3\928a40d1ffd01dd16057f308042377afc505d56145375adf40
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [24]:
import mysql.connector  		#importing database

database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "python_class_630"
)
db = database.cursor()

In [26]:
db.execute("Select * from student")
result = db.fetchall()
for x in result:
    print(x)

(2, 'Ram', 70, 80, 80, 90, 90, 90.0, 'B')
(3, 'Shyam', 90, 70, 50, 90, 80, 90.0, 'A')
(4, 'Hari', 90, 70, 50, 90, 80, 90.0, 'A')

In [9]:
db.execute("Select * from student where sn=1")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Andrew', 80, 90, 50, 70, 70, 80.0, 'B')

In [8]:
#insert
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `total`, `per`, `grade`) VALUES ('4', 'Hari', '90', '70', '50', '90', '80', '90', 'A');'''
db.execute(sql)
database.commit()

In [14]:
db.execute("Select * from student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Aarti', 80, 90, 50, 70, 70, 80.0, 'B')
(2, 'Ram', 70, 80, 80, 90, 90, 90.0, 'B')
(3, 'Shyam', 90, 70, 50, 90, 80, 90.0, 'A')
(4, 'Hari', 90, 70, 50, 90, 80, 90.0, 'A')

In [16]:
#update
sql = '''update student set name = "Baram" where sn = 1'''
db.execute(sql)
database.commit()

In [17]:
#update
db.execute("Select * from student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Baram', 80, 90, 50, 70, 70, 80.0, 'B')
(2, 'Ram', 70, 80, 80, 90, 90, 90.0, 'B')
(3, 'Shyam', 90, 70, 50, 90, 80, 90.0, 'A')
(4, 'Hari', 90, 70, 50, 90, 80, 90.0, 'A')

In [18]:
#delete
sql = '''delete from student where sn =1'''
db.execute(sql)
database.commit()

In [23]:
#update
db.execute("Select * from student")
result = db.fetchall()
for x in result:
    print(x)

NameError: name 'db' is not defined

In [20]:
#insert
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `total`, `per`, `grade`) VALUES ('5', 'Giri', '80', '70', '50', '90', '80', '90', 'A');'''
db.execute(sql)
database.commit()

In [ ]:
for i in range(10):
    name = input("Enter value = ")
    physics= int(input("Enter value = "))
    chemistry= int(input("Enter value = "))
    physics= int(input("Enter value = "))
    physics= int(input("Enter value = "))
    physics= int(input("Enter value = "))
    physics= int(input("Enter value = "))
    
    t = (name,physics,chemistry)
    print(t)
    sql = "INSERT INTO `student` (`sn`, `name`, `physics`) VALUES (%s, %s, %s)"
    val = [t]
    
mycursor.executemany(sql, val)

python_class_630.commit()

print(mycursor.rowcount, "record was inserted.")